reservas_api/app/controllers/authenticated_controller.rb

  def authenticate_request
    @access_token = request.headers['x-access-token']
    unless User.exists? access_token: @access_token
---
SELECT 1 AS one FROM "users" WHERE "users"."access_token" = $1 LIMIT $2
SELECT "users".* FROM "users" WHERE "users"."access_token" = $1 LIMIT $2