reservas_api/app/controllers/booking_requests_controller.rb

  def create
    create_params = create_params_filter
    puts create_params.inspect
    validation = BookingRequestForm.new(create_params).validate

    unless validation.success?
      return render json: validation.errors, status: 400
    end

    @place = Place.find_by(id: create_params[:place_id], enabled: true)
    unless @place
      return render json: { error: [I18n.t('errors.not_found')] }, status: 404
    end

    from = create_params[:from]
    to = create_params[:to]

    @conflicting_booking = @place.bookings.where('bookings.cancelled = false AND (bookings.from between ? and ? or bookings.to between ? and ?)', from, to, from, to)

    if @conflicting_booking.present?
      return render json: { error: [I18n.t('errors.already_booked')] }, status: 409
    end

    if @place.auto_accept
      @booking = Booking.create(
        from: from,
        to: to,
        place_id: @place.id,
        user_id: @current_user.id,
        approved_by_user_id: @place.place_admins.first.id,
      )
      @booking_request = BookingRequest.create(
        place_id: @place.id,
        from: from,
        to: to,
        user_id: @current_user.id,
        accepted: true,
        booking_id: @booking.id
      )
      return render json: @booking_request
    end

    @booking_request = BookingRequest.create(place_id: @place.id, from: from, to: to, user_id: @current_user.id)
---
SELECT "places".* FROM "places" WHERE "places"."id" = $1 AND "places"."enabled" = $2 LIMIT $3  [["id", 1], ["enabled", true], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."place_id" = $1 AND (bookings.cancelled = false AND (bookings.from between '2021-06-14 08:18:00' and '2021-06-14 09:18:00' or bookings.to between '2021-06-14 08:18:00' and '2021-06-14 09:18:00'))  [["place_id", 1]]
SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookings" ("from", "to", "place_id", "user_id", "approved_by_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "place_admins".* FROM "place_admins" WHERE "place_admins"."place_id" = $1 ORDER BY "place_admins"."id" ASC LIMIT $2  [["place_id", 1], ["LIMIT", 1]]
INSERT INTO "booking_requests" ("from", "to", "place_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["from", "2021-06-14 08:18:00"], ["to", "2021-06-14 09:18:00"], ["place_id", 1], ["user_id", 1], ["created_at", "2021-06-15 01:00:03.304158"], ["updated_at", "2021-06-15 01:00:03.304158"]]
INSERT INTO "booking_requests" ("start", "end", "place_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start", "2021-06-14 04:18:00"], ["end", "2021-06-14 05:18:00"], ["place_id", 1], ["user_id", 1], ["created_at", "2021-06-14 03:19:45.160050"], ["updated_at", "2021-06-14 03:19:45.160050"]]

  def destroy
    @booking_request = @current_user.booking_requests.find_by(id: params[:id])
---
SELECT "booking_requests".* FROM "booking_requests" WHERE "booking_requests"."user_id" = $1 AND (accepted is null)  [["user_id", 1]]

  def made
    @booking_requests = @current_user.booking_requests.where('accepted is null OR accepted is false').last(100)
---
SELECT "booking_requests".* FROM "booking_requests" WHERE "booking_requests"."user_id" = $1 AND (accepted is null OR accepted is false) ORDER BY "booking_requests"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 100]]

  def received
    @booking_requests = BookingRequest.joins("JOIN place_admins on booking_requests.place_id = place_admins.place_id and place_admins.user_id = #{@current_user.id}")
---
SELECT "booking_requests".* FROM "booking_requests" JOIN place_admins on booking_requests.place_id = place_admins.place_id and place_admins.user_id = 1
SELECT "places".* FROM "places" INNER JOIN "place_admins" ON "places"."id" = "place_admins"."place_id" WHERE "place_admins"."user_id" = $1 AND "places"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def answer
    answer_params = answer_params_filter
    @booking_request = BookingRequest.find_by(id: answer_params[:id], accepted: nil)

    unless @booking_request.present?
      return render json: { error: [I18n.t('errors.not_found')] }, status: 404
    end

    unless @current_user.places.find_by(id: @booking_request[:place_id])
      return render json: { error: [I18n.t('errors.not_found')] }, status: 404
    end

    unless answer_params[:accepted]
      @booking_request.update(accepted: false)
      return render json: @booking_request
    end

    ActiveRecord::Base.transaction do
      @booking = Booking.create(
        from: @booking_request.from,
        to: @booking_request.to,
        place: @booking_request.place,
        user: @booking_request.user,
        approved_by_user_id: @current_user.id
      )
---
SELECT "booking_requests".* FROM "booking_requests" WHERE "booking_requests"."id" = $1 AND "booking_requests"."accepted" IS NULL LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "booking_requests" SET accepted = false, note = 'conflict' WHERE (booking_requests.accepted IS NULL AND booking_requests.place_id = 1 AND booking_requests.from between '2021-06-14 08:18:00' and '2021-06-14 09:18:00' or booking_requests.to between '2021-06-14 08:18:00' and '2021-06-14 09:18:00')
INSERT INTO "bookings" ("from", "to", "place_id", "user_id", "approved_by_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"