reservas_api/app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND (bookings.cancelled = false AND bookings.from > '2021-06-15 03:00:05.902578')  [["user_id", 1]]
---
  def index
    @bookings = @current_user.bookings.where('bookings.cancelled = false AND bookings.from > ?', DateTime.now)

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "bookings" SET "cancelled" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["cancelled", true], ["updated_at", "2021-06-15 03:04:58.231308"], ["id", 1]]
---
  def cancel
    @booking = @current_user.bookings.find_by(id: params[:id])
    unless @booking.present?
      return render json: [error: [I18n.t('errors.not_found')]], status: 404
    end

    @booking.update(cancelled: true)