reservas_api/app/controllers/places_controller.rb

  def create
    validations = PlaceForm.new(create_params_filter).validate
    unless validations.success?
      return render json: validations.errors, status: 400
    end

    @place = Place.create(create_params_filter)
    PlaceAdmin.create(user: @current_user, place: @place)
---
INSERT INTO "places" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sala 41"], ["address", "av. x, #123"], ["created_at", "2021-06-14 00:57:48.164438"], ["updated_at", "2021-06-14 00:57:48.164438"]]
INSERT INTO "place_admins" ("user_id", "place_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["place_id", 1], ["created_at", "2021-06-14 00:28:54.857534"], ["updated_at", "2021-06-14 00:28:54.857534"]]

  def update
    update_params = update_params_filter
    @place = @current_user.places.find_by(id: update_params[:id])

    unless @place
      return render json: [error: [I18n.t('errors.not_found')]], status: 404
    end

    validations = PlaceForm.new(update_params).validate
    unless validations.success?
      return render json: validations.errors
    end

    @place.update(update_params)
---
SELECT "places".* FROM "places" INNER JOIN "place_admins" ON "places"."id" = "place_admins"."place_id" WHERE "place_admins"."user_id" = $1 AND "places"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "name" = $1, "auto_accept" = $2, "updated_at" = $3 WHERE "places"."id" = $4  [["name", "sala 47"], ["auto_accept", true], ["updated_at", "2021-06-14 03:24:18.707736"], ["id", 1]]

  def enable
    update_params = update_params_filter
    @place = @current_user.places.find_by(id: update_params[:id])
    unless @place
      return render json: [error: [I18n.t('errors.not_found')]], status: 404
    end

    @place.update(enabled: true)
---
SELECT "places".* FROM "places" INNER JOIN "place_admins" ON "places"."id" = "place_admins"."place_id" WHERE "place_admins"."user_id" = $1 AND "places"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "enabled" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["enabled", true], ["updated_at", "2021-06-14 00:30:12.256294"], ["id", 1]]

  def disable
    update_params = update_params_filter
    @place = @current_user.places.find_by(id: update_params[:id])
    unless @place
      return render json: [error: [I18n.t('errors.not_found')]], status: 404
    end

    # TODO: Reject any pending requests
    # TODO: Cancel any pending bookings
    @place.update(enabled: false)
---
SELECT "places".* FROM "places" INNER JOIN "place_admins" ON "places"."id" = "place_admins"."place_id" WHERE "place_admins"."user_id" = $1 AND "places"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "places" SET "enabled" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["enabled", false], ["updated_at", "2021-06-14 00:58:03.063298"], ["id", 1]]

  def search
    search_params = params.permit(:name, :address)

    if search_params[:name] && search_params[:address]
      @result = Place.where('name LIKE ? or address LIKE ?', "%#{search_params[:name]}%", "%#{search_params[:address]}%").first(10)
---
SELECT "places".* FROM "places" WHERE (name LIKE %'juca'%) ORDER BY "places"."id" ASC LIMIT $1  [["LIMIT", 10]]

  def bookings
    @place = Place.find_by(id: params[:id])

    unless @place.present?
      return render json: [error: [I18n.t('errors.not_found')]], status: 404
    end

    @bookings = @place.bookings.where('bookings.cancelled = false AND bookings.from > ?', DateTime.now)
---
SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."place_id" = $1 AND (bookings.cancelled = false AND bookings.from > '2021-06-15 02:59:04.256802')  [["place_id", 1]]