reservas_api/app/controllers/users_controller.rb

  def signup
    signup_params = signup_params_filter
    validation = Signup.new(signup_params).validate
    unless validation.success?
      return render json: validation.errors, status: 400
    end

    if User.exists?(signup_params.require(:email))
      return render json: { email: [I18n.t('errors.email.taken')] }, status: 400
    end

    rsa_private = OpenSSL::PKey::RSA.new(ENV['RESERVAS-API_RSA-PRIVATE-KEY'])
    payload = { email: signup_params.require(:email),
                password: signup_params.require(:password) }
    token = JWT.encode payload, rsa_private, 'RS256'
    @user = User.create(name: signup_params[:name], email: signup_params[:email], access_token: token)
---
INSERT INTO "users" ("name", "email", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def login
    login_params = login_params_filter
    validation = Login.new(login_params).validate

    unless validation.success?
      return render json: validation.errors, status: 400
    end

    rsa_private = OpenSSL::PKey::RSA.new(ENV['RESERVAS-API_RSA-PRIVATE-KEY'])
    payload = { email: login_params[:email],
                password: login_params.require(:password) }
    token = JWT.encode payload, rsa_private, 'RS256'
    @user = User.find_by email: login_params[:email], access_token: token
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."access_token" = $2 LIMIT $3